from bottle import post, request
import re
import pdb
import json
import random
@post ('/var2', method = 'post')
def vglubiny():
    #алгоритм в глубину
    def dfs(graph, node, visited):
        if node not in visited:
            visited.append(node)
            for n in graph[node]:
                dfs(graph,n, visited)
        return(visited)
   
    #генерация словаря смежности вершин
    i=random.randint(1,5)
    if i==1:
        graph0 = {'1': ['2', '3'], '2': ['1','4', '5'], '3': ['1','5'], '4':['2','5'], '5':['2','3','4']} 
        mtrx=[[0,1,1,0,0],[1,0,0,1,1],[1,0,0,0,1],[0,1,0,0,1],[0,1,1,1,0]]
    elif i==2:
        graph0 = {'1': ['2', '3'], '2': ['1','3'], '3': ['1','2']} 
        mtrx=[[0,1,1],[1,0,1],[1,1,0]]
    elif i==3:
        graph0 = {'1': ['2', '3'], '2': ['1','3'], '3': ['1','2','4'], '4': ['3']} 
        mtrx=[[0,1,1,0],[1,0,1,0],[1,1,0,1],[0,0,1,0]]
    elif i==4:
        graph0 = {'1': ['2', '3'], '2': ['1','3','4','5'], '3': ['1','2'], '4': ['2','5'], '5': ['2','4','6'], '6': ['5']} 
        mtrx=[[0,1,1,0,0,0],[1,0,1,1,1,0],[1,1,0,0,0,0],[0,1,0,0,1,0],[0,1,0,1,0,1],[0,0,0,0,1,0]]
    elif i==5:
        graph0 = {'1': ['2', '3', '4'], '2': ['1', '3', '4'], '3': ['1','2','4'], '4':['1','2','3']} 
        mtrx=[[0,1,1,1],[1,0,1,1],[1,1,0,1],[1,1,1,0]]
 
    #прием переменных, введенных с клавиатуры на вкладке данного метода
    strt2=request.forms.get('START2')

    #запуск алгоритма в глубину
    visited = dfs(graph0, strt2, [])

    #вывод
    final_output="Случайносгенерированный словарь смежности вершин:  <br>  " + str(graph0) + "<br><br> Матрица смежности вершин: <br>" + str(mtrx) + "<br><br> Порядок обхода: <br> " + str(visited) + "<br><br> Обход был начат в вершине: <br> " + str(strt2)+""
    return(final_output)

